-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2019-10-23 14:51:59
-- 服务器版本： 10.1.28-MariaDB
-- PHP Version: 5.6.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `art`
--

-- --------------------------------------------------------

--
-- 表的结构 `art_user`
--

CREATE TABLE `art_user` (
  `uid` int(11) NOT NULL,
  `uname` varchar(32) DEFAULT NULL,
  `upwd` varchar(32) DEFAULT NULL,
  `email` varchar(64) DEFAULT NULL,
  `phone` varchar(16) DEFAULT NULL,
  `user_name` varchar(32) DEFAULT NULL,
  `gender` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `art_user`
--

INSERT INTO `art_user` (`uid`, `uname`, `upwd`, `email`, `phone`, `user_name`, `gender`) VALUES
(1, 'hanxu', '123456', 'hanxu@qq.com', '13501234567', '韩旭', 0),
(2, 'hanyang', '123456', 'hanyang@qq.com', '13501234568', '韩阳', 0),
(3, 'jinmozhu', '123456', 'jinmozhu@qq.com', '13501234569', '金墨竹', 0),
(4, 'liubei', '123456', 'liubei@qq.com', '13501234560', '刘备', 1),
(5, 'guanyu', '123456', 'guanyu@qq.com', '23501234567', '关羽', 1),
(8, 'zhaoyun', '123456', 'zhaoyun@qq.com', '23501234560', '赵云', 1),
(9, '解润东', '123456', '2687109021@qq.com', '25036871414user_', NULL, 1),
(10, 'hanyang', '123456', '32323@qq.com', '13941799530', '韩旭', 1),
(11, '解润', '123456', '34@qq.com', '54user_name韩旭', NULL, 1),
(12, '解3434', '123456', '34@qq.com', '13841799530', '葛笑赛', 1),
(13, '对策女大三', '123456', '2687109021@qq.com', '25036871414', '韩旭', 1),
(14, '解润东22', '123456', '34@qq.com', '25036871414', '葛笑赛', 1),
(15, '曹尼玛部', '435', '2687109021@qq.com', '25036871414', '葛笑赛', 1);

-- --------------------------------------------------------

--
-- 表的结构 `product_details`
--

CREATE TABLE `product_details` (
  `pid` tinyint(8) NOT NULL,
  `pname` varchar(8) NOT NULL,
  `synopsis` text NOT NULL,
  `quality` text NOT NULL,
  `limits` text NOT NULL,
  `note` text NOT NULL,
  `details` text NOT NULL,
  `pic` varchar(25) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `product_details`
--

INSERT INTO `product_details` (`pid`, `pname`, `synopsis`, `quality`, `limits`, `note`, `details`, `pic`) VALUES
(1, '原木铲勺', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '厨房', '禁止放入微波炉、消毒柜', '铲勺是由一名65岁的英国退休老妇人格丽特·奥卡拉汉发明的一项厨房用品。铲勺只是刮刀、罐子和长柄勺的混合体，看起来更像是半个有把手的杯子。既可以帮使用者轻松盛到留在锅底的汤、菜，又不会在刮蹭锅底时发出噪音', '../img/art2.jpg'),
(2, '家用室内香薰精油', '天然植物精油，散发植物清香，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '玻璃', '居室', '百合、茉莉、海洋、玫瑰', '避光，阴凉处密封保存，在38°以下未开封保存\r\n本品就只后会产生少量职务纤维析出，属于正常现象，不影响除臭功能，使用时候摇匀即可', '../img/art3.jpg'),
(3, '仙人掌盆栽', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '厨房', '禁止放入微波炉、消毒柜', '起飞页是响应式建站专家，拥有全球最领先的屏幕界面智能识别技术，实现所有建站功能组件在多种屏幕下的完美呈现，真正让您的桌面/平板/手机3个网站同步生成，还可连接微信公众平台，创建您的微站。当今最领先的响应式自助建站平台，我们的流线式网页布局设计方案和可视化图文内容编辑模式让网站制作和维护成为一件轻松惬意的事。无论您是普通互联网用户， 还是专业网站制作人员，都能使用起飞页设计出最具专业水准的网站。 ', '../img/art2.jpg'),
(4, '纯色简单打底T恤', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '日用', '禁止粘油不易清洗', '起飞页是响应式建站专家，拥有全球最领先的屏幕界面智能识别技术，实现所有建站功能组件在多种屏幕下的完美呈现，真正让您的桌面/平板/手机3个网站同步生成，还可连接微信公众平台，创建您的微站。当今最领先的响应式自助建站平台，我们的流线式网页布局设计方案和可视化图文内容编辑模式让网站制作和维护成为一件轻松惬意的事。无论您是普通互联网用户， 还是专业网站制作人员，都能使用起飞页设计出最具专业水准的网站。 ', '../img/art8.jpg'),
(5, '现代简约家庭座椅', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '厨房', '禁止放入微波炉、消毒柜', '起飞页是响应式建站专家，拥有全球最领先的屏幕界面智能识别技术，实现所有建站功能组件在多种屏幕下的完美呈现，真正让您的桌面/平板/手机3个网站同步生成，还可连接微信公众平台，创建您的微站。当今最领先的响应式自助建站平台，我们的流线式网页布局设计方案和可视化图文内容编辑模式让网站制作和维护成为一件轻松惬意的事。无论您是普通互联网用户， 还是专业网站制作人员，都能使用起飞页设计出最具专业水准的网站。 ', '../img/art11.jpg'),
(6, 'LED灯家庭照明', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '厨房', '禁止放入微波炉、消毒柜', '起飞页是响应式建站专家，拥有全球最领先的屏幕界面智能识别技术，实现所有建站功能组件在多种屏幕下的完美呈现，真正让您的桌面/平板/手机3个网站同步生成，还可连接微信公众平台，创建您的微站。当今最领先的响应式自助建站平台，我们的流线式网页布局设计方案和可视化图文内容编辑模式让网站制作和维护成为一件轻松惬意的事。无论您是普通互联网用户， 还是专业网站制作人员，都能使用起飞页设计出最具专业水准的网站。 ', '../img/art4.jpg'),
(7, '家用无纺布脏衣篓', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '厨房', '禁止放入微波炉、消毒柜', '起飞页是响应式建站专家，拥有全球最领先的屏幕界面智能识别技术，实现所有建站功能组件在多种屏幕下的完美呈现，真正让您的桌面/平板/手机3个网站同步生成，还可连接微信公众平台，创建您的微站。当今最领先的响应式自助建站平台，我们的流线式网页布局设计方案和可视化图文内容编辑模式让网站制作和维护成为一件轻松惬意的事。无论您是普通互联网用户， 还是专业网站制作人员，都能使用起飞页设计出最具专业水准的网站。 ', '../img/art20.jpg'),
(8, '去湿防霉干燥剂', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '厨房', '禁止放入微波炉、消毒柜', '起飞页是响应式建站专家，拥有全球最领先的屏幕界面智能识别技术，实现所有建站功能组件在多种屏幕下的完美呈现，真正让您的桌面/平板/手机3个网站同步生成，还可连接微信公众平台，创建您的微站。当今最领先的响应式自助建站平台，我们的流线式网页布局设计方案和可视化图文内容编辑模式让网站制作和维护成为一件轻松惬意的事。无论您是普通互联网用户， 还是专业网站制作人员，都能使用起飞页设计出最具专业水准的网站。 ', '../img/art12.jpg'),
(9, '护眼节能灯', '黑胡桃木加工，手工打磨，表面有环保生漆，光滑细腻，重量适中，粗细均匀，没有其他材料比木更能给人自然的感觉。', '黑胡桃木', '厨房', '禁止放入微波炉、消毒柜', '起飞页是响应式建站专家，拥有全球最领先的屏幕界面智能识别技术，实现所有建站功能组件在多种屏幕下的完美呈现，真正让您的桌面/平板/手机3个网站同步生成，还可连接微信公众平台，创建您的微站。当今最领先的响应式自助建站平台，我们的流线式网页布局设计方案和可视化图文内容编辑模式让网站制作和维护成为一件轻松惬意的事。无论您是普通互联网用户， 还是专业网站制作人员，都能使用起飞页设计出最具专业水准的网站。 ', '../img/art5.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `art_user`
--
ALTER TABLE `art_user`
  ADD PRIMARY KEY (`uid`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `art_user`
--
ALTER TABLE `art_user`
  MODIFY `uid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
